#include "main.h"
float dpv0 = 0, dpv1 = 0;

char botToken[50] = "";  // your Bot Token (Get from Botfather);
char chatID [15] = "";   // your Chat ID (search for “IDBot” or open this link t.me/myidbot in your smartphone.)
uint8_t data[8];
uint8_t dataLed[6];

SensorType detectedSensor = UNKNOWN;    // Переменная для хранения определенного типа датчика

bool shouldSaveConfig = false;//flag for saving data
bool enabledListen = false;
bool hasChanged = false;

uint8_t numberOfDevices,    // число найденых датчиков
        displNum,           // вариант дисплея
        resetDispl,         // время ожидания до возврата главного диплея
        numSetup,           // пунк выбора установки
        pctHeater,          // значение мощности нагревателя
        pctHimidifier,      // значение мощности увлажнителя
        pvFlap,             // текущее положение заслонки
        beepOn,             // время звучания бипера
        disableBeep,        // время запрета включения аварийной сигнализации
        lastKey,            // последняя нажатая кнопка
        keys,               // текущая кнопка
        keyCount,           // время удержания последней кнопки
        lastDayProcessed,   // день последней записи файлов
        halfSecond,         // счетчик пол-секунды
        countSeconds,       // счетчик секунд
        countMinutes,       // счетчик минут
        countHours,         // счетчик часов
        countDays = 0,      // счетчик дней
        stagnationTimer = 0; // счетчик минут отсутствия роста температуры

int16_t pvAeration,         // текущее время проветривания
        pvVenting,          // ? текущее время проветривания
        editBuff,           // временное хранилище редактируемой установки
        lastMinuteT = 0;    // температура минуту назад

uint16_t    pvRH,           // текущая относительная влажность
            heaterValue,    // расчетное значение ШИМ сигнала нагревателя
            humidiValue,    // расчетное значение ШИМ сигнала увлажнителя
            pvTimer,        // текущее значение таймера
            pvPulse,        // расчетное значение длетельности работы помпы
            pvPeriod,       // расчетное значение периода работы помпы
            waitCheckKeyPad = WAITCHECKKEYPAD;

long counterWait,           // опорный интервал опроса кнопок
        counter10,          // опорный интервал 10 милисекунд 
        counter1000,        // опорный интервал 1000 милисекунд
        counter500;         // опорный интервал 500 милисекунд

// Адрес PCF8574. Может быть разным в зависимости от конфигурации A0, A1, A2.
// Стандартные адреса: 0x20-0x27 для PCF8574 и 0x38-0x3F для PCF8574A.
// Уточните адрес вашего модуля. Часто по умолчанию 0x27 или 0x3F.
#define PCF8574_ADDRESS 0x27 // Замените на ваш адрес, если необходимо
//---------------------------------
uint8_t earlyMode = 0, mode = READEEPROM, tmrResetMode = 0, quarter = GET_PROG1, errors, seconds = 0;
int tableData[32][4] = {0}, tmrTelegramOff = 30;
uint16_t begHeapSize, previousHeapSize;
long lastSendTime = 0, allTime = 0; 
Interval interval = INTERVAL_1000;
//---------------------------------
Ds ds[MAX_DEVICE] = {{1990,0,0,0,0,0},{1990,0,0,0,0},{1990,0,0,0,0}};

//---------------------------------

union Byte portOut;
union Byte errorsFlag;
union Byte portFlag;

SpUnion settings = {
    .sp_structs = { // Явно говорим, что инициализируем поле sp_structs
        { // Элемент sp_structs[0]
            .spT = SPT_0,               // завдання у грд.Цесія #1 = 350 (35,0 °C)
            .spRH = SPRH_0,             // завдання у відсотках (ПОДСТРОЙКА HIH) = 0
            .alarm = ALARM_0,           // аварійне відхилення нагрів №1 = 5 (0,5 °C)
            .coolOn = COOLON_0,         // охолоджувач увімкнути №1 = 3 (0,3 °C)
            .coolOff = COOLOFF_0,       // охолоджувач вимкнути №1 = 1 (0,1 °C)
            .timer = TIMER_0,           // лотки увім. = 60 хв.
            .aeration = AERATION_0,     // провітр.пауза ПАУЗА ПРОВЕТРИВАНИЯ (минут) = 10
            .auxiliary = AUXILIARY_0,   // допоміж. увім. = 5 (0,5 °C)
            .state = STATE_0,           // заслінка полож. = 0 - закрита; 100 - відкрита
            .flapLimit = FLPCLOSE,      // заслінка закр.
            .pulse = PULSE_0,           // імпульс мінім. = 100 (0,5 сек.)
            .mode = MODE_0,             // режим реле = 0-НЕТ; 1->по кан.[0] 2->по кан.[1] 3->по кан.[0]&[1]; 4-импульс
            .extendMode = EXTMODE_0,    // аварійн. режим = 0-СИРЕНА; 1-АВАРИЙНОЕ ОТКЛЮЧЕНИЕ;
            .Kp = KP_0_1,               // пропорц. 1 (Kp/4) = 80       [20*4]
            .Ki = KI_0_1,               // ітеграл. 1 (Ki/10000) = 400  [20/500*10000]
            .special = SPECIAL0,        // таймаут для портала конфигурации WiFi маска 0x03
        },
        { // Элемент sp_structs[1] (можно оставить пустым для инициализации нулями)
            .spT = SPT_1,               // завдання у грд.Цесія №2 = 300 (30,0 °C)
            .spRH = SPRH_1,             // завдання у відсотках №2 = 650 (65%)
            .alarm = ALARM_1,           // аварійне відхилення №2 = 15 (1,5 °C)
            .coolOn = COOLON_1,         // осушувач увімкнути №2 = 10 (1,0 °C)
            .coolOff = COOLOFF_1,       // осушувач вимкнути №2 = 5 (0,5 °C)
            .timer = TIMER_1,           // лотки вимкн. = 0
            .aeration = AERATION_1,     // провітр. робота ДЛИТЕЛЬНОСТЬ ПРОВЕТРИВАНИЯ (секунд) = 0
            .auxiliary = AUXILIARY_1,   // допоміж. вимкн. = 2 (0,2 °C)
            .state = STATE_1,           // задана програма = 0
            .flapLimit = FLPOPEN,       // заслінка відкр.
            .pulse = PULSE_1,           // імпульс період = 999 (16 хв.)
            .mode = MODE_1,             // затрим. зволож. -> 1; 2-УВЛАЖНИТЕЛЬ; 0-НЕТ
            .extendMode = EXTMODE_1,    // 1-ОХЛАЖДЕНИЕ; 2-ОСУШЕНИЕ; 3-ОХЛАЖДЕНИЕ + ОСУШЕНИЕ
            .Kp = KP_0_1,               // пропорц. 2 (Kp/4) = 80       [20*4]
            .Ki = KI_0_1,               // ітеграл. 2 (Ki/10000) = 400  [20/500*10000]
            .special = SPECIAL1,        // номер прибора маска 0x0F
        }
    }
};

const uint8_t tabRH[420]={
95,90,86,81,77,72,68,64,60,56,52,48,44,40,36,32,29,25,22,18,
95,91,86,82,77,73,69,65,61,57,53,49,45,42,38,34,31,27,24,20,
95,91,87,82,78,74,70,66,62,58,54,50,47,43,40,36,33,29,26,23,
96,91,87,83,79,75,71,67,63,59,55,52,48,45,41,38,34,31,28,25,
96,91,87,83,79,75,71,67,64,60,56,53,49,46,43,39,36,33,30,26,
96,92,88,84,80,76,72,68,65,61,57,54,51,47,44,41,37,34,31,28,
96,92,88,84,80,76,73,69,65,62,58,55,52,48,45,42,39,36,33,30,
96,92,88,84,80,77,73,70,66,63,59,56,53,50,46,43,40,37,34,32,
96,92,88,85,81,77,74,70,67,64,60,57,54,51,48,45,42,39,36,33,
96,92,89,85,81,78,74,71,68,64,61,58,55,52,49,46,43,40,37,35,
96,92,89,85,82,78,75,71,68,65,62,59,56,53,50,47,44,41,39,36,
96,93,89,85,82,79,75,72,69,66,63,60,57,54,51,48,45,42,40,37,
96,93,89,86,82,79,76,73,69,66,63,60,57,55,52,49,46,44,41,38,
96,93,89,86,83,79,76,73,70,67,64,61,58,55,53,50,47,45,42,40,
96,93,90,86,83,80,77,74,71,68,65,62,59,56,54,51,48,46,43,41,
97,93,90,87,83,80,77,74,71,68,65,62,60,57,54,52,49,47,44,42,
97,93,90,87,84,80,77,74,72,69,66,63,60,58,55,53,50,48,45,43,
97,93,90,87,84,81,78,75,72,69,66,64,61,58,56,53,51,48,46,44,
97,93,90,87,84,81,78,75,72,70,67,64,62,59,57,54,52,49,47,45,
97,94,90,87,84,81,79,76,73,70,67,65,62,60,57,55,52,50,48,46,
97,94,91,88,85,82,79,76,73,71,68,65,63,60,58,56,53,51,49,46
};