#include "main.h"


// Пин, к которому подключен информационный вывод (DQ) датчика DS18B20

uint8_t numberOfDevices, errDevice[MAX_DEVICE];

// Адрес PCF8574. Может быть разным в зависимости от конфигурации A0, A1, A2.
// Стандартные адреса: 0x20-0x27 для PCF8574 и 0x38-0x3F для PCF8574A.
// Уточните адрес вашего модуля. Часто по умолчанию 0x27 или 0x3F.
#define PCF8574_ADDRESS 0x27 // Замените на ваш адрес, если необходимо
long counter10, counter1s;
//---------------------------------
int16_t pvAeration, pvVenting, editBuff;
// bool newDispl = true, newTxt = true;
// Глобальный массив указателей, который будет доступен всем функциям
// const char* keyLabel[15];
// uint16_t keyColor[15], xpos, ypos, txt_height, t_x = 0, t_y = 0;
uint16_t pvVadcRH, pvRH, heaterValue, humidiValue, pvPulse, waitCheckKeyPad = WAITCHECKKEYPAD;
uint8_t displNum=0, resetDispl, numSetup, seconds, displPower, pvTimer, pvFlap, beepOn;
long counterWait;
float editValue;
//---------------------------------
Ds ds[2] = {{200,0,0,0,0},{180,0,0,0,0}};
float dpv0, dpv1;
//---------------------------------

union Byte portOut;
union Byte errorsFlag;
union Byte portFlag;
//************************************************************************************************** */
#define FLPCLOSE 9
#define FLPOPEN  24
// РЕКОМЕНДУЕМЫЙ СПОСОБ:
SpUnion settings = {
    .sp_structs = { // Явно говорим, что инициализируем поле sp_structs
        { // Элемент sp_structs[0]
            .spT = 350,             // завдання у грд.Цесія #1 = 350
            .spRH = 1,              // завдання у відсотках (ПОДСТРОЙКА HIH) = 0
            .alarm = 2,             // аварійне відхилення #1 = 5
            .coolOn = 3,            // знижувач увімкнути #1 = 3
            .coolOff = 4,           // знижувач вимкнути #1 = 1
            .timer = 5,             // лотки увім. = 60
            .aeration = 6,          // провітр.пауза ПАУЗА ПРОВЕТРИВАНИЯ (минут) = 10
            .auxiliary = 7,         // допоміж. увім. = ?
            .state = 8,             // заслінка полож. = 0 - закрита; 100 - відкрита
            .flapLimit = FLPCLOSE,  // заслінка закр.
            .pulse = 10,            // імпульс мінім. = 100 = 0,5 сек.
            .mode = 11,             // період імпульс. = 3000 = 15 сек.
            .extendMode = 12,       // режим реле = 0-НЕТ; 1->по кан.[0] 2->по кан.[1] 3->по кан.[0]&[1]; 4-импульс
            .Kp = 13,               // пропорц. 1 (Kp/10) = 200
            .Ki = 14,               // ітеграл. 1 (Ki/1000) = 40
        },
        { // Элемент sp_structs[1] (можно оставить пустым для инициализации нулями)
            .spT = 300,             // завдання у грд.Цесія #2 = 300
            .spRH = 16,             // завдання у відсотках #2 = 650
            .alarm = 17,            // аварійне відхилення #2 = 15
            .coolOn = 18,           // знижувач увімкнути #2 = 10
            .coolOff = 19,          // знижувач вимкнути #2 = 5
            .timer = 20,            // лотки вимкн. = 0
            .aeration = 21,         // провітр. робота ДЛИТЕЛЬНОСТЬ ПРОВЕТРИВАНИЯ (секунд) = 0
            .auxiliary = 22,        // допоміж. вимкн. = ?
            .state = 23,            // задана програма = 0
            .flapLimit = FLPOPEN,   // заслінка відкр.
            .pulse = 25,            // імпульс максім. = 2000 = 10 сек.
            .mode = 26,             // аварійн. режим = 0-СИРЕНА; 1-АВАРИЙНОЕ ОТКЛЮЧЕНИЕ;
            .extendMode = 27,       // затрим. зволож. = 0
            .Kp = 28,               // пропорц. 2 (Kp/10) = 200
            .Ki = 29,               // ітеграл. 2 (Ki/1000) = 40
        }
    }
};

const uint8_t tabRH[420]={
95,90,86,81,77,72,68,64,60,56,52,48,44,40,36,32,29,25,22,18,
95,91,86,82,77,73,69,65,61,57,53,49,45,42,38,34,31,27,24,20,
95,91,87,82,78,74,70,66,62,58,54,50,47,43,40,36,33,29,26,23,
96,91,87,83,79,75,71,67,63,59,55,52,48,45,41,38,34,31,28,25,
96,91,87,83,79,75,71,67,64,60,56,53,49,46,43,39,36,33,30,26,
96,92,88,84,80,76,72,68,65,61,57,54,51,47,44,41,37,34,31,28,
96,92,88,84,80,76,73,69,65,62,58,55,52,48,45,42,39,36,33,30,
96,92,88,84,80,77,73,70,66,63,59,56,53,50,46,43,40,37,34,32,
96,92,88,85,81,77,74,70,67,64,60,57,54,51,48,45,42,39,36,33,
96,92,89,85,81,78,74,71,68,64,61,58,55,52,49,46,43,40,37,35,
96,92,89,85,82,78,75,71,68,65,62,59,56,53,50,47,44,41,39,36,
96,93,89,85,82,79,75,72,69,66,63,60,57,54,51,48,45,42,40,37,
96,93,89,86,82,79,76,73,69,66,63,60,57,55,52,49,46,44,41,38,
96,93,89,86,83,79,76,73,70,67,64,61,58,55,53,50,47,45,42,40,
96,93,90,86,83,80,77,74,71,68,65,62,59,56,54,51,48,46,43,41,
97,93,90,87,83,80,77,74,71,68,65,62,60,57,54,52,49,47,44,42,
97,93,90,87,84,80,77,74,72,69,66,63,60,58,55,53,50,48,45,43,
97,93,90,87,84,81,78,75,72,69,66,64,61,58,56,53,51,48,46,44,
97,93,90,87,84,81,78,75,72,70,67,64,62,59,57,54,52,49,47,45,
97,94,90,87,84,81,79,76,73,70,67,65,62,60,57,55,52,50,48,46,
97,94,91,88,85,82,79,76,73,71,68,65,63,60,58,56,53,51,49,46
};